# Домашнее задание

In [2]:
import pandas as pd

## Задание 1
### Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [102]:
# подгружаем данные по фильмам
movies = pd.read_csv('movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [22]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   title    9742 non-null   object
 2   genres   9742 non-null   object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB

In [23]:
# подгружаем данные по рейтингам
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [17]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [70]:
# объединяем данные через merge. выбрал inner чтобы подгрузить фильмы, по которым есть рейтинги, и рейтинги привязанные к фильмам (мало ли что с исходными данными)
move_rates = movies.merge(ratings, how = 'inner', left_on='movieId', right_on='movieId')
move_rates.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483

In [71]:
move_rates.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100836 entries, 0 to 100835
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   movieId    100836 non-null  int64
 1   title      100836 non-null  object
 2   genres     100836 non-null  object
 3   userId     100836 non-null  int64
 4   rating     100836 non-null  float64
 5   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 5.4+ MB

In [101]:
# отбираем все рейтинги равные 5, группируем по названию фильма, считаем количества, выводим c конца 1 запись
move_rates[ move_rates['rating'] == 5].groupby('title').count().sort_values(by=['rating']).tail(1)

                                  movieId  genres  userId  rating  timestamp
title
Shawshank Redemption, The (1994)      153     153     153     153        153

## Задание 2
### По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [107]:
# подгружаем данные по потреблению
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [108]:
power.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [115]:
power[ power['country'].str.contains('nia', case=False) ]['country'].unique()

array(['Romania', 'Lithuania', 'T.F.Yug.Rep. Macedonia', 'Armenia',
       'Estonia', 'Mauritania', 'New Caledonia', 'Slovenia',
       'United Rep. of Tanzania', 'Albania', 'Bosnia and Herzegovina'],
      dtype=object)

In [166]:
power[ power['country'].str.contains('via', case=False) ]['country'].unique()

array(['Latvia', 'Bolivia (Plur. State of)', 'Yugoslavia, SFR (former)'],
      dtype=object)

In [145]:
# пошёл по пути списков
countries = ['Lithuania', 'Estonia', 'Latvia']
categories = [4, 12 , 21]
years = [2005, 2006, 2007, 2008, 2009, 2010]

In [167]:
# подсмотрел в Сети такой решение с фильтрами по спискам 
# выбираем интересующие нас страны
# выбираем интересующие нас категории
# выбираем интересующие нас годы
# выбираемположительные значения
# отбираем колонку "количества" и ссумируем её
power.loc[power['country'].isin(countries)].loc[power['category'].isin(categories)].loc[power['year'].isin(years)].loc[power['quantity'] > 0].iloc[:, 2].sum()
# буду признателе за подсказку альтернативных решений фильтра датафрейма по спискам (так как по мне данное решение громоздкое)

240580.0

## Задание 3
### Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
### Примеры страниц (необязательно брать именно эти):
#### https://fortrader.org/quotes 
#### https://www.finanz.ru/valyuty/v-realnom-vremeni

In [177]:
eur_rub = pd.read_html('https://www.finanz.ru/valyuty/eur-rub', encoding='utf-8')[5]

In [180]:
eur_rub

       Дата  Закрытие  Открытие  Максимум  Минимум
0  09.03.21    881810    882910    884535   878286
1  08.03.21    882905    886290    888186   880300
2  07.03.21    885570    885570    885570   885570
3  06.03.21    886095    886095    886095   886095
4  05.03.21    886095    893965    894070   884099
5  04.03.21    893905    892405    897461   883719
6  03.03.21    892420    891690    894111   887545
7  02.03.21    891710    896280    897322   885351
8  01.03.21    896245    900355    902415   889965

In [181]:
type(eur_rub)

pandas.core.frame.DataFrame